package study.test;

public class Level4 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		/*
		사용자 대신 자동 시뮬레이션으로 장르를 변경합니다.
		투수가 던지는 공에 스트라이크와 볼을 추가 합니다.

		이를 위해, 사용자 입력 대신, 1 ~ 100의 난수로 설정합니다.
		투수가 던지는 공도 1 ~ 100의 난수로 설정합니다.

		투수가 던지는 공 중 아래의 값 사이에 들어올 경우 스트라이크로 간주합니다.
		1 ~ 10, 50 ~ 60, 90 ~100
		그 외의 값은 볼로 간주 합니다.
		(사용자 값과 투수의 값의 차이가 +-3까지는 스트라이크와 볼 상관 없이 안타)
		ex) 사용자 값 50 인 경우, 투수의 값이 47~53 까지 안타

		타자는 스트라이크가 3개 일 경우 아웃이 되며,
		볼이 4개일 경우 안타로 처리 됩니다.

		안타 혹은 아웃 이후, 다음 타자가 타석에 들어설 때
		스트라이크와 볼은 0으로 시작됩니다.

		*한번 휘두를 때를 기준으로 타석수를 계산합니다.
		*이전에는 안타, 아웃뿐이었지만,
		*스트라이크, 볼 등이 추가된 버전에서는 타율계산 변경! 타율 = 안타수 / 타수(배트 휘두른 수)
		*/
		
		
		
		
	}

}
